Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/pio.h
#define PIO_P_MSKR_MSK_Pos                    _UINT32_(0)                                          /* (PIO_P_MSKR Position) PIO Line 3x Mask */
#define PIO_P_MSKR_MSK_Msk                    (_UINT32_(0xFFFFFFFF) << PIO_P_MSKR_MSK_Pos)         /* (PIO_P_MSKR Mask) MSK */
#define PIO_P_MSKR_MSK(value)                 (PIO_P_MSKR_MSK_Msk & (_UINT32_(value) << PIO_P_MSKR_MSK_Pos)) 

/* -------- PIO_P_CFGR : (PIO Offset: 0x04) (R/W 32) PIO Privilege Configuration Register (p_iogroup = 0) -------- */
#define PIO_P_CFGR_FUNC_Pos                   _UINT32_(0)                                          /* (PIO_P_CFGR) I/O Line Function Position */
#define PIO_P_CFGR_FUNC_Msk                   (_UINT32_(0x7) << PIO_P_CFGR_FUNC_Pos)               /* (PIO_P_CFGR) I/O Line Function Mask */
#define PIO_P_CFGR_FUNC(value)                (PIO_P_CFGR_FUNC_Msk & (_UINT32_(value) << PIO_P_CFGR_FUNC_Pos)) /* Assigment of value for FUNC in the PIO_P_CFGR register */
#define   PIO_P_CFGR_FUNC_GPIO_Val            _UINT32_(0x0)                                        /* (PIO_P_CFGR) Select the PIO mode for the selected I/O lines.  */
#define   PIO_P_CFGR_FUNC_PERIPH_A_Val        _UINT32_(0x1)                                        /* (PIO_P_CFGR) Select the peripheral A for the selected I/O lines.  */
#define   PIO_P_CFGR_FUNC_PERIPH_B_Val        _UINT32_(0x2)                                        /* (PIO_P_CFGR) Select the peripheral B for the selected I/O lines.  */
#define   PIO_P_CFGR_FUNC_PERIPH_C_Val        _UINT32_(0x3)                                        /* (PIO_P_CFGR) Select the peripheral C for the selected I/O lines.  */
#define   PIO_P_CFGR_FUNC_PERIPH_D_Val        _UINT32_(0x4)                                        /* (PIO_P_CFGR) Select the peripheral D for the selected I/O lines.  */
#define PIO_P_CFGR_FUNC_GPIO                  (PIO_P_CFGR_FUNC_GPIO_Val << PIO_P_CFGR_FUNC_Pos)    /* (PIO_P_CFGR) Select the PIO mode for the selected I/O lines. Position  */
#define PIO_P_CFGR_FUNC_PERIPH_A              (PIO_P_CFGR_FUNC_PERIPH_A_Val << PIO_P_CFGR_FUNC_Pos) /* (PIO_P_CFGR) Select the peripheral A for the selected I/O lines. Position  */
#define PIO_P_CFGR_FUNC_PERIPH_B              (PIO_P_CFGR_FUNC_PERIPH_B_Val << PIO_P_CFGR_FUNC_Pos) /* (PIO_P_CFGR) Select the peripheral B for the selected I/O lines. Position  */
#define PIO_P_CFGR_FUNC_PERIPH_C              (PIO_P_CFGR_FUNC_PERIPH_C_Val << PIO_P_CFGR_FUNC_Pos) /* (PIO_P_CFGR) Select the peripheral C for the selected I/O lines. Position  */
#define PIO_P_CFGR_FUNC_PERIPH_D              (PIO_P_CFGR_FUNC_PERIPH_D_Val << PIO_P_CFGR_FUNC_Pos) /* (PIO_P_CFGR) Select the peripheral D for the selected I/O lines. Position  */
#define PIO_P_CFGR_DIR_Pos                    _UINT32_(8)                                          /* (PIO_P_CFGR) Direction Position */
#define PIO_P_CFGR_DIR_Msk                    (_UINT32_(0x1) << PIO_P_CFGR_DIR_Pos)                /* (PIO_P_CFGR) Direction Mask */
#define PIO_P_CFGR_DIR(value)                 (PIO_P_CFGR_DIR_Msk & (_UINT32_(value) << PIO_P_CFGR_DIR_Pos)) /* Assigment of value for DIR in the PIO_P_CFGR register */
#define   PIO_P_CFGR_DIR_INPUT_Val            _UINT32_(0x0)                                        /* (PIO_P_CFGR) The selected I/O lines are pure inputs.  */
#define   PIO_P_CFGR_DIR_OUTPUT_Val           _UINT32_(0x1)                                        /* (PIO_P_CFGR) The selected I/O lines are enabled in output.  */
#define PIO_P_CFGR_DIR_INPUT                  (PIO_P_CFGR_DIR_INPUT_Val << PIO_P_CFGR_DIR_Pos)     /* (PIO_P_CFGR) The selected I/O lines are pure inputs. Position  */
#define PIO_P_CFGR_DIR_OUTPUT                 (PIO_P_CFGR_DIR_OUTPUT_Val << PIO_P_CFGR_DIR_Pos)    /* (PIO_P_CFGR) The selected I/O lines are enabled in output. Position  */
#define PIO_P_CFGR_PUEN_Pos                   _UINT32_(9)                                          /* (PIO_P_CFGR) Pull-Up Enable Position */
#define PIO_P_CFGR_PUEN_Msk                   (_UINT32_(0x1) << PIO_P_CFGR_PUEN_Pos)               /* (PIO_P_CFGR) Pull-Up Enable Mask */
#define PIO_P_CFGR_PUEN(value)                (PIO_P_CFGR_PUEN_Msk & (_UINT32_(value) << PIO_P_CFGR_PUEN_Pos)) /* Assigment of value for PUEN in the PIO_P_CFGR register */
#define   PIO_P_CFGR_PUEN_DISABLED_Val        _UINT32_(0x0)                                        /* (PIO_P_CFGR) Pull-Up is disabled for the selected I/O lines.  */
#define   PIO_P_CFGR_PUEN_ENABLED_Val         _UINT32_(0x1)                                        /* (PIO_P_CFGR) Pull-Up is enabled for the selected I/O lines.  */
#define PIO_P_CFGR_PUEN_DISABLED              (PIO_P_CFGR_PUEN_DISABLED_Val << PIO_P_CFGR_PUEN_Pos) /* (PIO_P_CFGR) Pull-Up is disabled for the selected I/O lines. Position  */
#define PIO_P_CFGR_PUEN_ENABLED               (PIO_P_CFGR_PUEN_ENABLED_Val << PIO_P_CFGR_PUEN_Pos) /* (PIO_P_CFGR) Pull-Up is enabled for the selected I/O lines. Position  */
#define PIO_P_CFGR_PDEN_Pos                   _UINT32_(10)                                         /* (PIO_P_CFGR) Pull-Down Enable Position */
#define PIO_P_CFGR_PDEN_Msk                   (_UINT32_(0x1) << PIO_P_CFGR_PDEN_Pos)               /* (PIO_P_CFGR) Pull-Down Enable Mask */
#define PIO_P_CFGR_PDEN(value)                (PIO_P_CFGR_PDEN_Msk & (_UINT32_(value) << PIO_P_CFGR_PDEN_Pos)) /* Assigment of value for PDEN in the PIO_P_CFGR register */
#define   PIO_P_CFGR_PDEN_DISABLED_Val        _UINT32_(0x0)                                        /* (PIO_P_CFGR) Pull-Down is disabled for the selected I/O lines.  */
#define   PIO_P_CFGR_PDEN_ENABLED_Val         _UINT32_(0x1)                                        /* (PIO_P_CFGR) Pull-Down is enabled for the selected I/O lines only if PUEN is 0.  */
#define PIO_P_CFGR_PDEN_DISABLED              (PIO_P_CFGR_PDEN_DISABLED_Val << PIO_P_CFGR_PDEN_Pos) /* (PIO_P_CFGR) Pull-Down is disabled for the selected I/O lines. Position  */
#define PIO_P_CFGR_PDEN_ENABLED               (PIO_P_CFGR_PDEN_ENABLED_Val << PIO_P_CFGR_PDEN_Pos) /* (PIO_P_CFGR) Pull-Down is enabled for the selected I/O lines only if PUEN is 0. Position  */
#define PIO_P_CFGR_IFEN_Pos                   _UINT32_(12)                                         /* (PIO_P_CFGR) Input Filter Enable Position */
#define PIO_P_CFGR_IFEN_Msk                   (_UINT32_(0x1) << PIO_P_CFGR_IFEN_Pos)               /* (PIO_P_CFGR) Input Filter Enable Mask */
#define PIO_P_CFGR_IFEN(value)                (PIO_P_CFGR_IFEN_Msk & (_UINT32_(value) << PIO_P_CFGR_IFEN_Pos)) /* Assigment of value for IFEN in the PIO_P_CFGR register */
#define   PIO_P_CFGR_IFEN_DISABLED_Val        _UINT32_(0x0)                                        /* (PIO_P_CFGR) The input filter is disabled for the selected I/O lines.  */
#define   PIO_P_CFGR_IFEN_ENABLED_Val         _UINT32_(0x1)                                        /* (PIO_P_CFGR) The input filter is enabled for the selected I/O lines.  */
#define PIO_P_CFGR_IFEN_DISABLED              (PIO_P_CFGR_IFEN_DISABLED_Val << PIO_P_CFGR_IFEN_Pos) /* (PIO_P_CFGR) The input filter is disabled for the selected I/O lines. Position  */
#define PIO_P_CFGR_IFEN_ENABLED               (PIO_P_CFGR_IFEN_ENABLED_Val << PIO_P_CFGR_IFEN_Pos) /* (PIO_P_CFGR) The input filter is enabled for the selected I/O lines. Position  */
#define PIO_P_CFGR_IFSCEN_Pos                 _UINT32_(13)                                         /* (PIO_P_CFGR) Input Filter Slow Clock Enable Position */
#define PIO_P_CFGR_IFSCEN_Msk                 (_UINT32_(0x1) << PIO_P_CFGR_IFSCEN_Pos)             /* (PIO_P_CFGR) Input Filter Slow Clock Enable Mask */
#define PIO_P_CFGR_IFSCEN(value)              (PIO_P_CFGR_IFSCEN_Msk & (_UINT32_(value) << PIO_P_CFGR_IFSCEN_Pos)) /* Assigment of value for IFSCEN in the PIO_P_CFGR register */
#define PIO_P_CFGR_OPD_Pos                    _UINT32_(14)                                         /* (PIO_P_CFGR) Open-Drain Position */
#define PIO_P_CFGR_OPD_Msk                    (_UINT32_(0x1) << PIO_P_CFGR_OPD_Pos)                /* (PIO_P_CFGR) Open-Drain Mask */
#define PIO_P_CFGR_OPD(value)                 (PIO_P_CFGR_OPD_Msk & (_UINT32_(value) << PIO_P_CFGR_OPD_Pos)) /* Assigment of value for OPD in the PIO_P_CFGR register */
#define   PIO_P_CFGR_OPD_DISABLED_Val         _UINT32_(0x0)                                        /* (PIO_P_CFGR) The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level.  */
#define   PIO_P_CFGR_OPD_ENABLED_Val          _UINT32_(0x1)                                        /* (PIO_P_CFGR) The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only.  */
#define PIO_P_CFGR_OPD_DISABLED               (PIO_P_CFGR_OPD_DISABLED_Val << PIO_P_CFGR_OPD_Pos)  /* (PIO_P_CFGR) The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level. Position  */
#define PIO_P_CFGR_OPD_ENABLED                (PIO_P_CFGR_OPD_ENABLED_Val << PIO_P_CFGR_OPD_Pos)   /* (PIO_P_CFGR) The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only. Position  */
#define PIO_P_CFGR_SCHMITT_Pos                _UINT32_(15)                                         /* (PIO_P_CFGR) Schmitt Trigger Position */
#define PIO_P_CFGR_SCHMITT_Msk                (_UINT32_(0x1) << PIO_P_CFGR_SCHMITT_Pos)            /* (PIO_P_CFGR) Schmitt Trigger Mask */
#define PIO_P_CFGR_SCHMITT(value)             (PIO_P_CFGR_SCHMITT_Msk & (_UINT32_(value) << PIO_P_CFGR_SCHMITT_Pos)) /* Assigment of value for SCHMITT in the PIO_P_CFGR register */
#define   PIO_P_CFGR_SCHMITT_ENABLED_Val      _UINT32_(0x0)                                        /* (PIO_P_CFGR) Schmitt trigger is enabled for the selected I/O lines.  */
#define   PIO_P_CFGR_SCHMITT_DISABLED_Val     _UINT32_(0x1)                                        /* (PIO_P_CFGR) Schmitt trigger is disabled for the selected I/O lines.  */
#define PIO_P_CFGR_SCHMITT_ENABLED            (PIO_P_CFGR_SCHMITT_ENABLED_Val << PIO_P_CFGR_SCHMITT_Pos) /* (PIO_P_CFGR) Schmitt trigger is enabled for the selected I/O lines. Position  */
#define PIO_P_CFGR_SCHMITT_DISABLED           (PIO_P_CFGR_SCHMITT_DISABLED_Val << PIO_P_CFGR_SCHMITT_Pos) /* (PIO_P_CFGR) Schmitt trigger is disabled for the selected I/O lines. Position  */
#define PIO_P_CFGR_SLEWRATE_Pos               _UINT32_(16)                                         /* (PIO_P_CFGR) Slew Rate Position */
#define PIO_P_CFGR_SLEWRATE_Msk               (_UINT32_(0x3) << PIO_P_CFGR_SLEWRATE_Pos)           /* (PIO_P_CFGR) Slew Rate Mask */
#define PIO_P_CFGR_SLEWRATE(value)            (PIO_P_CFGR_SLEWRATE_Msk & (_UINT32_(value) << PIO_P_CFGR_SLEWRATE_Pos)) /* Assigment of value for SLEWRATE in the PIO_P_CFGR register */
#define   PIO_P_CFGR_SLEWRATE_FAST_Val        _UINT32_(0x0)                                        /* (PIO_P_CFGR) Slow slew rate  */
#define   PIO_P_CFGR_SLEWRATE_MEDIUMFAST_Val  _UINT32_(0x1)                                        /* (PIO_P_CFGR) Medium-fast slew rate  */
#define   PIO_P_CFGR_SLEWRATE_MEDIUM_Val      _UINT32_(0x2)                                        /* (PIO_P_CFGR) Medium slew rate  */
#define   PIO_P_CFGR_SLEWRATE_SLOW_Val        _UINT32_(0x3)                                        /* (PIO_P_CFGR) Slow slew rate  */
#define PIO_P_CFGR_SLEWRATE_FAST              (PIO_P_CFGR_SLEWRATE_FAST_Val << PIO_P_CFGR_SLEWRATE_Pos) /* (PIO_P_CFGR) Slow slew rate Position  */
#define PIO_P_CFGR_SLEWRATE_MEDIUMFAST        (PIO_P_CFGR_SLEWRATE_MEDIUMFAST_Val << PIO_P_CFGR_SLEWRATE_Pos) /* (PIO_P_CFGR) Medium-fast slew rate Position  */
#define PIO_P_CFGR_SLEWRATE_MEDIUM            (PIO_P_CFGR_SLEWRATE_MEDIUM_Val << PIO_P_CFGR_SLEWRATE_Pos) /* (PIO_P_CFGR) Medium slew rate Position  */
#define PIO_P_CFGR_SLEWRATE_SLOW              (PIO_P_CFGR_SLEWRATE_SLOW_Val << PIO_P_CFGR_SLEWRATE_Pos) /* (PIO_P_CFGR) Slow slew rate Position  */
#define PIO_P_CFGR_EVTSEL_Pos                 _UINT32_(24)                                         /* (PIO_P_CFGR) Event Selection Position */
#define PIO_P_CFGR_EVTSEL_Msk                 (_UINT32_(0x7) << PIO_P_CFGR_EVTSEL_Pos)             /* (PIO_P_CFGR) Event Selection Mask */
#define PIO_P_CFGR_EVTSEL(value)              (PIO_P_CFGR_EVTSEL_Msk & (_UINT32_(value) << PIO_P_CFGR_EVTSEL_Pos)) /* Assigment of value for EVTSEL in the PIO_P_CFGR register */
#define   PIO_P_CFGR_EVTSEL_FALLING_Val       _UINT32_(0x0)                                        /* (PIO_P_CFGR) Event detection on input falling edge  */
#define   PIO_P_CFGR_EVTSEL_RISING_Val        _UINT32_(0x1)                                        /* (PIO_P_CFGR) Event detection on input rising edge  */
#define   PIO_P_CFGR_EVTSEL_BOTH_Val          _UINT32_(0x2)                                        /* (PIO_P_CFGR) Event detection on input both edge  */
#define   PIO_P_CFGR_EVTSEL_LOW_Val           _UINT32_(0x3)                                        /* (PIO_P_CFGR) Event detection on low level input  */
#define   PIO_P_CFGR_EVTSEL_HIGH_Val          _UINT32_(0x4)                                        /* (PIO_P_CFGR) Event detection on high level input  */
#define PIO_P_CFGR_EVTSEL_FALLING             (PIO_P_CFGR_EVTSEL_FALLING_Val << PIO_P_CFGR_EVTSEL_Pos) /* (PIO_P_CFGR) Event detection on input falling edge Position  */
#define PIO_P_CFGR_EVTSEL_RISING              (PIO_P_CFGR_EVTSEL_RISING_Val << PIO_P_CFGR_EVTSEL_Pos) /* (PIO_P_CFGR) Event detection on input rising edge Position  */
#define PIO_P_CFGR_EVTSEL_BOTH                (PIO_P_CFGR_EVTSEL_BOTH_Val << PIO_P_CFGR_EVTSEL_Pos) /* (PIO_P_CFGR) Event detection on input both edge Position  */
#define PIO_P_CFGR_EVTSEL_LOW                 (PIO_P_CFGR_EVTSEL_LOW_Val << PIO_P_CFGR_EVTSEL_Pos) /* (PIO_P_CFGR) Event detection on low level input Position  */
#define PIO_P_CFGR_EVTSEL_HIGH                (PIO_P_CFGR_EVTSEL_HIGH_Val << PIO_P_CFGR_EVTSEL_Pos) /* (PIO_P_CFGR) Event detection on high level input Position  */
#define PIO_P_CFGR_PCFS_Pos                   _UINT32_(29)                                         /* (PIO_P_CFGR) Physical Configuration Freeze Status (read-only) Position */
#define PIO_P_CFGR_PCFS_Msk                   (_UINT32_(0x1) << PIO_P_CFGR_PCFS_Pos)               /* (PIO_P_CFGR) Physical Configuration Freeze Status (read-only) Mask */
#define PIO_P_CFGR_PCFS(value)                (PIO_P_CFGR_PCFS_Msk & (_UINT32_(value) << PIO_P_CFGR_PCFS_Pos)) /* Assigment of value for PCFS in the PIO_P_CFGR register */
#define   PIO_P_CFGR_PCFS_NOT_FROZEN_Val      _UINT32_(0x0)                                        /* (PIO_P_CFGR) The fields are not frozen and can be written for this I/O line.  */
#define   PIO_P_CFGR_PCFS_FROZEN_Val          _UINT32_(0x1)                                        /* (PIO_P_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields.  */
#define PIO_P_CFGR_PCFS_NOT_FROZEN            (PIO_P_CFGR_PCFS_NOT_FROZEN_Val << PIO_P_CFGR_PCFS_Pos) /* (PIO_P_CFGR) The fields are not frozen and can be written for this I/O line. Position  */
#define PIO_P_CFGR_PCFS_FROZEN                (PIO_P_CFGR_PCFS_FROZEN_Val << PIO_P_CFGR_PCFS_Pos)  /* (PIO_P_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields. Position  */
#define PIO_P_CFGR_ICFS_Pos                   _UINT32_(30)                                         /* (PIO_P_CFGR) Interrupt Configuration Freeze Status (read-only) Position */
#define PIO_P_CFGR_ICFS_Msk                   (_UINT32_(0x1) << PIO_P_CFGR_ICFS_Pos)               /* (PIO_P_CFGR) Interrupt Configuration Freeze Status (read-only) Mask */
#define PIO_P_CFGR_ICFS(value)                (PIO_P_CFGR_ICFS_Msk & (_UINT32_(value) << PIO_P_CFGR_ICFS_Pos)) /* Assigment of value for ICFS in the PIO_P_CFGR register */
#define   PIO_P_CFGR_ICFS_NOT_FROZEN_Val      _UINT32_(0x0)                                        /* (PIO_P_CFGR) The fields are not frozen and can be written for this I/O line.  */
#define   PIO_P_CFGR_ICFS_FROZEN_Val          _UINT32_(0x1)                                        /* (PIO_P_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields.  */
#define PIO_P_CFGR_ICFS_NOT_FROZEN            (PIO_P_CFGR_ICFS_NOT_FROZEN_Val << PIO_P_CFGR_ICFS_Pos) /* (PIO_P_CFGR) The fields are not frozen and can be written for this I/O line. Position  */
#define PIO_P_CFGR_ICFS_FROZEN                (PIO_P_CFGR_ICFS_FROZEN_Val << PIO_P_CFGR_ICFS_Pos)  /* (PIO_P_CFGR) The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields. Position  */
#define PIO_P_CFGR_Msk                        _UINT32_(0x6703F707)                                 /* (PIO_P_CFGR) Register Mask  */


